import unittest
from solution2 import get_animals_from_wikipedia

# при запуске теста происходит реальное скачивание всех страниц
# в идеале надо сохранить html одной страницы в файл и вынести парсинг html'а в отдельную функцию, которую можно изолированно протестировать

tests = {'С': 2860, 'И': 605, 'P': 3307, 'Д': 1049, 'А': 1301, 'П': 2358, 'Б': 1781, 'В': 553, 'Г': 1060, 'Е': 108, 'Ё': 2, 'О': 845, 'Ж': 423, 'Я': 227, 'З': 675, 'Й': 4, 'К': 2445, 'Л': 743, 'М': 1368, 'R': 551, 'Н': 500, 'Р': 612, 'Т': 1062, 'У': 288, 'Ф': 204, 'Х': 299, 'Ц': 245, 'Ч': 735, 'Ш': 291, 'Щ': 162, 'Э': 238, 'Ю': 148, 'A': 3574, 'B': 1103, 'C': 2790, 'D': 1179, 'E': 1158, 'F': 276, 'G': 763, 'H': 1202, 'I': 403, 'J': 95, 'K': 259, 'L': 1184, 'M': 1943, 'N': 939, 'O': 938, 'Q': 46, 'S': 2050, 'T': 1584, 'U': 167, 'V': 208, 'W': 103, 'X': 188, 'Y': 54, 'Z': 243}

class TestGetAnimals(unittest.TestCase):
    def test(self):
        self.assertEqual(get_animals_from_wikipedia(), tests)

if __name__ == "__main__":
    unittest.main()
